Былков_ДА_70180166/src/Documents/АкадемическаяНеуспеваемость/АкадемическаяНеуспеваемость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АкадемическаяНеуспеваемость</name>
  <registerRecords>AccumulationRegister.КонтрольАкадемическойНеуспеваемости</registerRecords>
  <attributes>
    <name>ИндексСтудента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикаСтудента</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.ФормаКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВозникновенияЗадолженности</name>
      <type>
        <types>EnumRef.ПричинаВозникновенияЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Былков_ДА_70180166/src/AccumulationRegisters/КонтрольАкадемическойНеуспеваемости/КонтрольАкадемическойНеуспеваемости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КонтрольАкадемическойНеуспеваемости</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПересдачПоДисциплинам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИндексСтудента</name>
    <type>
      <types>CatalogRef.ЛичныеИндексыСтудентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВозникновения</name>
    <type>
      <types>EnumRef.ПричинаВозникновенияЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Былков_ДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильСтудента</name>
    <type>
      <types>CatalogRef.ПрофилиПодготовкиСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Былков_ДА_70180166/src/Documents/АкадемическаяНеуспеваемость/ObjectModule.bsl
&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)

	// Проверка заполненности индекса
    Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИндексСтудента) Тогда
        ВызватьИсключение "Не указан личный индекс студента!";
    КонецЕсли;
    
    // Проверка существования студента
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Ссылка
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.ЛичныйИндекс = &ЛичныйИндекс
    |    И НЕ Студенты.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("ЛичныйИндекс", ЭтотОбъект.ИндексСтудента);
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        НеверныйИндекс = ЭтотОбъект.ИндексСтудента;
		Отказ = Истина;

		ВызватьИсключение "Студент с индексом '" + НеверныйИндекс + "' не найден! Поле было очищено.";
		Возврат;

	КонецЕсли; 
	
	// регистр КонтрольАкадемическойНеуспеваемости 
	Движения.КонтрольАкадемическойНеуспеваемости.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристикаСтудента Из ХарактеристикаСтудента Цикл
		Движение = Движения.КонтрольАкадемическойНеуспеваемости.Добавить();
		Движение.Период = Дата;
		Движение.ИндексСтудента = ИндексСтудента;
		Движение.Дисциплина = ТекСтрокаХарактеристикаСтудента.Дисциплина;
		Движение.ПричинаВозникновения = ТекСтрокаХарактеристикаСтудента.ПричинаВозникновенияЗадолженности;
		Движение.Семестр = ТекСтрокаХарактеристикаСтудента.Семестр;
		Движение.КоличествоПересдачПоДисциплинам = ТекСтрокаХарактеристикаСтудента.НомерСтроки;
	КонецЦикла;

КонецПроцедуры
